windkesselSolver/sampleCaseFile/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }

   "(C_tPA|C_PLG|C_PLS|flowRate)" 
    {
       solver            PBiCG;
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0;
    };

    "(n_tPA|n_PLG|n_PLS)" 
    {
       solver            PBiCG;
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0;
    };

    "(n_tot|L_PLS)"  
    {
       solver            PBiCG;
        preconditioner   DILU;
        tolerance        1e-6;
        relTol           0;
    };
}


PIMPLE
{
    nOuterCorrectors 20;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
	U
	{
		tolerance 1e-5;
		relTol 0;
	}

	p
	{
		tolerance 5e-4;
		relTol 0;
	}


    }
}

relaxationFactors
{
    fields
    {
	p	0.3;
	pFinal	1;
    }


    equations
    {
        "U.*"           0.1;
	"C_*"           	0.7;
	"n_*"           	0.7;
	L_PLS           	0.7;
        "k.*"           1;
        "epsilon.*"     1;
    }
}



// ************************************************************************* //
